In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import json, math, time
from tqdm.notebook import tqdm_notebook
import tmdbsimple as tmdb
import os
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy.types import *
from sqlalchemy_utils import create_database, database_exists

In [2]:
with open('/Users/ashley/.secret/mysql.json', 'r') as f:
    login = json.load(f)
## Display the keys of the loaded dict
login.keys()

dict_keys(['username', 'password'])

In [3]:
connection_str = f"mysql+pymysql://{login['username']}:{login['password']}@localhost/Movies"
engine = create_engine(connection_str)

In [4]:
if database_exists(connection_str) == False: create_database(connection_str)
else: print('The database already exists.')

The database already exists.

In [5]:
basics = pd.read_csv('Data/title_basics.csv.gz')
ratings = pd.read_csv('Data/title_ratings.csv.gz')
tmdb = pd.read_csv('Data/tmdb_results_combined.csv.gz')

display(basics, ratings, tmdb)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0034413,False,Youth Gets a Break,Youth Gets a Break,0,2001,NaN,20,Short
1,tt0035423,False,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
2,tt0040241,False,Color Rhapsodie,Color Rhapsodie,0,2021,NaN,6,Short
3,tt0044326,False,Abstronic,Abstronic,0,2021,NaN,6,Short
4,tt0044879,False,Mandala,Mandala,0,2021,NaN,3,Short
...,...,...,...,...,...,...,...,...,...
471568,tt9916214,False,Drown the Clown,Drown the Clown,0,2019,NaN,8,"Drama,Short"
471569,tt9916254,False,Big Tit Cream Pie 32,Big Tit Cream Pie 32,1,2015,NaN,226,Adult
471570,tt9916348,False,Ancient World Exposed,Ancient World Exposed,0,2019,NaN,67,History
471571,tt9916362,False,Coven,Akelarre,0,2020,NaN,92,"Drama,History"
471572,tt9916720,False,The Nun 2,The Nun 2,0,2019,NaN,10,"Comedy,Horror,Mystery"

            tconst  averageRating  numVotes
0        tt0000001            5.7      1892
1        tt0000002            5.9       252
2        tt0000003            6.5      1682
3        tt0000004            5.7       165
4        tt0000005            6.2      2499
...            ...            ...       ...
1249493  tt9916690            6.5         6
1249494  tt9916720            5.2       228
1249495  tt9916730            8.4         6
1249496  tt9916766            6.7        20
1249497  tt9916778            7.2        35

[1249498 rows x 3 columns]

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.5,22.0,NaN
1,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,4.4,7.0,NaN
2,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,0.0,0.0,NaN
3,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",http://www.wkw-inthemoodforlove.com/,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.1,1900.0,PG
4,tt0118852,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}]",NaN,49511.0,en,Chinese Coffee,...,0.0,99.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,There's a fine line between friendship and bet...,Chinese Coffee,0.0,6.9,46.0,R
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4335,tt9077500,0.0,NaN,NaN,0.0,[],NaN,552089.0,en,Bardo,...,0.0,13.0,[],Released,NaN,Bardo,0.0,0.0,0.0,NaN
4336,tt9358360,0.0,NaN,NaN,0.0,"[{'id': 10749, 'name': 'Romance'}]",NaN,564567.0,en,Forbidden Lust,...,0.0,43.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Is it passion... or is it madness?,Forbidden Lust,0.0,0.0,0.0,NR
4337,tt9632192,0.0,NaN,NaN,0.0,"[{'id': 99, 'name': 'Documentary'}]",NaN,795324.0,en,The Wesley Willis Experience,...,0.0,10.0,[],Released,NaN,The Wesley Willis Experience,0.0,0.0,0.0,NaN
4338,tt9683070,0.0,NaN,NaN,0.0,"[{'id': 99, 'name': 'Documentary'}]",NaN,580253.0,en,2001 NBA Champions: Los Angeles Lakers,...,0.0,70.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,NaN,2001 NBA Champions: Los Angeles Lakers,0.0,0.0,0.0,NaN
4339,tt8870242,1.0,NaN,NaN,0.0,[],http://www.vistavideo.com/idols.php,995548.0,en,Idols,...,0.0,63.0,[],Released,NaN,Idols,0.0,0.0,0.0,NaN

In [6]:
#splitting the genre column into separate columns
basics['genres_split'] = basics['genres'].str.split(',')
exploded_genres = basics.explode('genres_split')
exploded_genres.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0034413,False,Youth Gets a Break,Youth Gets a Break,0,2001,NaN,20,Short,Short
1,tt0035423,False,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
1,tt0035423,False,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
1,tt0035423,False,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
2,tt0040241,False,Color Rhapsodie,Color Rhapsodie,0,2021,NaN,6,Short,Short

In [7]:
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [8]:
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0034413        Short
1  tt0035423       Comedy
1  tt0035423      Fantasy
1  tt0035423      Romance
2  tt0040241        Short

In [9]:
#making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [10]:
## make new integer genre_id and drop string genres
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')
title_genres.head()

      tconst  genre_id
0  tt0034413        20
1  tt0035423         5
1  tt0035423         9
1  tt0035423        18
2  tt0040241        20

In [11]:
genres = pd.DataFrame({'genre_name': genre_map.keys(),
                            'genre_id': genre_map.values()})
genres.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [12]:
title_basics = exploded_genres.drop(columns=["originalTitle", 'isAdult', 
                                              'titleType','endYear', 'genres', 
                                              'genres_split'])
title_basics.head()

      tconst        primaryTitle  startYear  runtimeMinutes
0  tt0034413  Youth Gets a Break       2001              20
1  tt0035423      Kate & Leopold       2001             118
1  tt0035423      Kate & Leopold       2001             118
1  tt0035423      Kate & Leopold       2001             118
2  tt0040241     Color Rhapsodie       2021               6

In [13]:
title_basics.duplicated(subset = 'tconst').sum()
title_basics = title_basics.drop_duplicates(subset= 'tconst')

In [14]:
tmdb_data = tmdb[['imdb_id', 'revenue', 'budget', 'certification']]
tmdb_data

        imdb_id     revenue      budget certification
0     tt0113026         0.0  10000000.0           NaN
1     tt0113092         0.0         0.0           NaN
2     tt0116391         0.0         0.0           NaN
3     tt0118694  12854953.0    150000.0            PG
4     tt0118852         0.0         0.0             R
...         ...         ...         ...           ...
4335  tt9077500         0.0         0.0           NaN
4336  tt9358360         0.0         0.0            NR
4337  tt9632192         0.0         0.0           NaN
4338  tt9683070         0.0         0.0           NaN
4339  tt8870242         0.0         0.0           NaN

[4340 rows x 4 columns]

In [15]:
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = title_basics['tconst'].fillna('').map(len).max()
title_len = title_basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Integer(),
    'runtimeMinutes':Integer()}

In [16]:
# Save to sql with dtype and index=False
title_basics.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

In [17]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [18]:
## Calculate max string lengths for object columns
key_len = title_genres['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "genre_id": Integer()}

In [19]:
# Save to sql with dtype and index=False
title_genres.to_sql('title_genres',engine,dtype=df_schema,if_exists='replace',index=False)

In [20]:
## Calculate max string lengths for object columns
key_len = ratings['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1),
    "averageRating": Float(),
    "numVotes": Integer()}

In [21]:
# Save to sql with dtype and index=False
ratings.to_sql('title_ratings',engine,dtype=df_schema,if_exists='replace',index=False)

In [22]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [23]:
## Calculate max string lengths for object columns
key_len = tmdb_data['imdb_id'].fillna('').map(len).max()
cert_len = tmdb_data['certification'].fillna('').map(len).max() 
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "imdb_id": String(key_len+1),
    'revenue': Float(), 
    'budget': Float(), 
    'certification': Text(cert_len+1)}

In [24]:
# Save to sql with dtype and index=False
tmdb_data.to_sql('tmdb_data',engine,dtype=df_schema,if_exists='replace',index=False)

In [25]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [26]:
# Save to sql with dtype and index=False
genres.to_sql('genres',engine,dtype=df_schema,if_exists='replace',index=False)

In [27]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

In [28]:
# checking if tables were created
q = """SHOW TABLES"""
pd.read_sql(q,engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data